#!/usr/bin/env python
# encoding: utf-8

"""
@version:
@author: Wish Chen
@contact: 986859110@qq.com
@file: dicts.py
@time: 2020/1/9

"""

areaDict = {
    '唯满侠': ['唯满侠', '唯我独尊'],
    '双梦': ['双梦', '梦江南'],
    '长安城': ['长安城'],
    '华乾': ['华乾', '乾坤一掷', '华山论剑'],
    '蝶恋花': ['蝶恋花'],
    '龙虎': ['龙虎', '龙争虎斗'],
    '姨妈': ['姨妈', '大姨妈', '斗转星移'],
    '六合一': ['六合一', '四合一', '幽月轮'],
    '剑胆': ['剑胆', '金榜', '剑胆琴心', '金榜题名'],
    '世外蓬莱': ['世外蓬莱'],
    '绝代': ['战无', '战无不胜', '绝代', '亢龙'],
    '纵月': ['纵月', '天鹅坪'],
    '念破': ['念破', '破阵子'],
    '飞龙': ['飞龙', '李忘生', '飞龙在天'],
    '青梅': ['青梅', '青梅煮酒', '怒海', '怒海争锋'],
}

areaList = ['唯满侠', '双梦', '长安城', '华乾', '蝶恋花', '龙虎', '姨妈', '六合一',
            '剑胆',  '世外蓬莱','绝代', '纵月', '念破', '飞龙', '青梅']

teamType = ['挑战巨冥湾', '挑战饕餮洞', '挑战jmw', '挑战ttd' ,'tzjmw', 'tzttd',
            '普通敖龙岛', '英雄敖龙岛', '普通ald', '英雄ald', 'ptald', 'yxald',
            '普通傲龙岛', '英雄傲龙岛', '普通范阳夜变', '英雄范阳夜变', 'ptfyyb', 'yxfyyb',
            'pt范阳夜变', 'yx范阳夜变', '英雄范阳夜店', '普通范阳夜店', '普通夜店', '英雄夜店',
            'pt达摩洞', 'yx达摩洞', '普通达摩洞', '英雄达摩洞', 'ptdmd', 'yxdmd',
            'pt白帝江关', 'yx白帝江关', '普通白帝江关', '英雄白帝江关', '普通白帝', '英雄白帝',
            '修罗挑战', '雷域大泽', 'yx雷域大泽', 'pt雷域大泽', '英雄雷域大泽', '普通雷域大泽',
            '河阳之战', 'yx河阳之战', 'pt河阳之战', '英雄河阳之战', '普通河阳之战', '英雄河阳', '普通河阳', 'yx河阳', 'pt河阳',
            '英雄龙渊泽', '英雄获花圣殿',
            '英雄西津渡', '普通西津渡', 'yx西津渡', 'pt西津渡', 'yxxjd', 'ptxjd', '西津渡'
            ]

areaSocketList = {
    '唯满侠': '125.88.195.89',
    '双梦': '125.88.195.59',
    '长安城': '125.88.195.52',
    '华乾': '125.88.195.154',
    '蝶恋花': '125.88.195.112',
    '龙虎': '125.88.195.69',
    '姨妈': '121.14.64.155',
    '六合一': '125.88.195.117',
    '剑胆': '125.88.195.42',
    '世外蓬莱': '121.14.64.213',
    '绝代': '121.14.64.162',
    '纵月': '120.92.176.35',
    '念破': '120.92.176.116',
    '飞龙': '120.92.176.21',
    '青梅': '120.92.176.215',
}

occuList = [
  '花间', '奶花', '冰心', '奶秀', '易筋', '洗髓',
  '气纯', '剑纯', '傲血', '铁牢', '藏剑', '毒经', '奶毒',
  '惊羽', '天罗', '焚影', '明尊', '丐帮', '分山', '铁骨',
  '莫问', '奶歌', '霸刀', '蓬莱', '凌雪', '衍天', '无方', '灵素',
  '刀宗'
]


occuDic = {
    '明尊': ['明尊', '明教T', '明尊琉璃体', '明教t', '喵T', '喵t', 'mjt'],
    '焚影': ['明教', '焚影', '明教DPS'],
    '冰心': ['冰心', '冰心诀', '打蓝小妹', '七秀', '秀秀', 'bx'],
    '奶秀': ['奶秀', '云裳', '云裳心经', '秀奶', 'nx'],
    '洗髓': ['和尚T', '洗髓', '洗髓经', '和尚t', 'hst'],
    '易筋': ['和尚', '和尚DPS', '易筋', '易筋经', '少林', '易经'],
    '气纯': ['气纯', '紫霞', '紫霞功', '渣男', 'qc'],
    '剑纯': ['剑纯', '太虚剑意', '太虚', '备胎', 'jc'],
    '莫问': ['莫问', '长歌DPS', '长歌'],
    '奶歌': ['奶歌', '奶鸽', '相知', '歌奶'],
    '天罗': ['田螺', '天罗诡道', '天罗'],
    '惊羽': ['鲸鱼', '惊羽', '惊羽诀'],
    '毒经': ['毒经', '五毒DPS', '五毒'],
    '奶毒': ['奶毒', '补天诀', '补天', '毒奶'],
    '铁骨': ['苍云T', '铁骨', '铁骨衣', '苍云t'],
    '分山': ['苍云DPS', '苍云', '分山', '岔劲', '分山劲'],
    '丐帮': ['丐帮', '笑尘诀', '笑尘'],
    '蓬莱': ['蓬莱', '伞爹', '凌海诀'],
    '藏剑': ['藏剑', '黄鸡', '二少'],
    '霸刀': ['霸刀', '北傲诀'],
    '铁牢': ['铁牢', '天策T', '铁牢律', '天策t', '策t', '策T', 'tct'],
    '傲血': ['傲血', '傲雪', '天策', '傲血战意', '天策DPS'],
    '花间': ['花间', '花间游', '花花', '花花DPS', '万花DPS', '万花'],
    '奶花': ['奶花', '离经', '离经易道', '花奶'],
    '凌雪': ['凌雪阁', '隐龙诀', '凌雪', ],
    '衍天': ['衍天', '衍天宗', '太玄经'],
    '无方': ['无方', '药宗'],
    '灵素': ['灵素', '药奶', '药宗奶', '奶药'],
    '刀宗': ['刀宗', '孤锋诀', '孤锋'],
}

occuTypeDic = {
    '外功': ['剑纯', '傲血', '藏剑', '惊羽', '丐帮', '分山', '霸刀', '蓬莱', '凌雪', '衍天', '刀宗'],
    '内功':['焚影', '花间', '冰心', '易筋', '气纯', '毒经', '天罗', '莫问', '无方'],
    '治疗':['奶花', '奶秀', '奶毒', '奶歌', '灵素'],
    'T': ['明尊', '铁牢', '洗髓', '铁骨'],
}

occuY = {
    '元气': ['易筋', '花间', '天罗', '焚影', '元气', '衍天'],
    '根骨': ['冰心', '气纯', '莫问', '毒经', '根骨'],
    '身法': ['剑纯', '分山', '凌雪', '蓬莱', '藏剑', '身法'],
    '力道': ['丐帮', '傲血', '霸刀', '惊羽', '力道', '刀宗'],
    '治疗': ['奶花', '奶歌', '奶毒', '奶秀', '治疗', '灵素'],
    't': ['明尊', '洗髓', '铁牢', '铁骨', 't', 'T'],
    '加速': ['加速'],
    '命中': ['命中'],
}

yaoDic = {
    '元气': '''元气（衍天/焚影/花间/和尚/田螺）
增强类药品：奉天·中品展凤散（攻击），奉天·中品破秽散（破防）
辅助类药品：奉天·中品聚魂丹（元气）
增强类食品：奉天·鲜肉包子（攻击），奉天·水煮肉片（破防），
辅助类食品：奉天·鱼头豆腐汤（元气）''',
    '根骨': '''根骨（毒经/气纯/冰心/莫问）
增强类药品：奉天·中品展凤散（攻击），奉天·中品破秽散（破防）
辅助类药品：奉天·中品静心丸（根骨）
增强类食品：奉天·鲜肉包子（攻击），奉天·水煮肉片（破防），
辅助类食品：奉天·老火骨汤（根骨）''',
    '身法': '''身法（苍云/蓬莱/凌雪/藏剑/剑纯）
增强类药品：奉天·中品亢龙散（攻击），奉天·中品凝神散（破招），奉天·中品破秽散（破防）
辅助类药品：奉天·中品轻身丹（身法）
增强类食品：奉天·煎饼果子（攻击），奉天·毛血旺（破招），奉天·水煮肉片（破防）
辅助类食品：奉天·杂碎汤（身法）''',
    '力道': '''力道（丐帮/傲血/霸刀/惊羽）
增强类药品：奉天·中品亢龙散（攻击），奉天·中品凝神散（破招），奉天·中品破秽散（破防）
辅助类药品：奉天·中品大力丸（力道）
增强类食品：奉天·煎饼果子（攻击），奉天·水煮肉片（破防），
辅助类食品：奉天·三鲜汤（力道）''',
    '治疗':'''治疗（奶花/奶毒/奶歌/奶花）
增强类药品：奉天·中品玉璃散（会心），奉天·中品益气散（治疗），奉天·中品活气散（加速650）
辅助类药品：奉天·中品静心丸（根骨）
增强类食品：奉天·鱼香肉丝（会心），奉天·白汁芦筋（治疗），奉天·栗子烧肉（加速506）
辅助类食品：奉天·老火骨汤（根骨）''',
    't':  '''T（明尊/铁牢/铁骨/洗髓）
增强类药品：奉天·中品长恨散（仇恨），奉天·中品凝神散（破招）
辅助类药品：奉天·中品健体丸（体质）
增强类食品：奉天·杂碎面（仇恨），奉天·毛血旺（破招）
辅助类食品：奉天·贡丸汤（体质）''',
    '加速': '加速小药为:\n【增食】:奉天·栗子烧肉（加速506）\n【增药】:奉天·中品活气散（加速650）\n',
    '命中': '命中小药为:\n【增食】:白肉血肠\n【增药】:上品凝神散\n',
}

imgDic = {
    '焚影': "../src/fy.png",
    '明尊': "../src/mz.png",
    '冰心':"../src/bx.png",
    '奶秀':"../src/yc.png",
    '易筋': "../src/yj.png",
    '洗髓':"../src/xs.png",
    '气纯': "../src/qc.png",
    '剑纯': "../src/jc.png",
    '莫问':"../src/mw.png",
    '奶歌':"../src/xz.png",
    '天罗': "../src/tl.png",
    '惊羽': "../src/jy.png",
    '毒经':"../src/dj.png",
    '奶毒': "../src/bt.png",
    '铁骨': "../src/tg.png",
    '分山': "../src/fs.png",
    '丐帮': "../src/xc.png",
    '蓬莱': "../src/pl.png",
    '藏剑': "../src/cj.png",
    '霸刀':"../src/bd.png",
    '傲血': "../src/ax.png",
    '铁牢': "../src/tct.png",
    '花间': "../src/hj.png",
    '奶花':"../src/lj.png",
    '凌雪': "../src/lx.png",
    '衍天': "../src/yt.jpg",
    '无方': "../src/wf.jpg",
    '灵素': "../src/ls.jpg",
    '刀宗': "../src/dz.jpg",

}

colorDic = {
    '焚影': "#FF7F24",
    '明尊': "#FF7F24",
    '冰心': "#ec89bb",
    '奶秀': "#ec89bb",
    '易筋': "#E5D570",
    '洗髓': "#E5D570",
    '气纯': "#00BFFF",
    '剑纯': "#00BFFF",
    '莫问': "#7FFFD4",
    '奶歌': "#7FFFD4",
    '天罗': "#79B736",
    '惊羽': "#79B736",
    '毒经': "#4169E1",
    '奶毒': "#4169E1",
    '铁骨': "#8B4513",
    '分山': "#8B4513",
    '丐帮': "#CD853F",
    '蓬莱': "#AEEEEE",
    '藏剑': "#FFF700",
    '霸刀': "#615492",
    '傲血': "#FF3030",
    '铁牢': "#FF3030",
    '花间': "#9999ff",
    '奶花': "#9999ff",
    '全职业': "#fafafa",
    '外功': "#bb3333",
    '内功': "#66ccff",
    '治疗': "#7f99d4",
    "T": "#8B6914",
    '凌雪': "#FFE7BA",
    '衍天': "#8d5cc6",
    '无方': '#1f4a89',
    '灵素': '#1f4a89',
  '刀宗': '#ff3030',
}


signOrder = {
    '焚影': [10,11,5,6,15,16,20,21,0,1,22,23,17,18,12,13,7,8,2,3,4,9,14,19,24],
    '明尊': [4,9,14,19,24,23,22,21,20,18,17,16,15,13,12,11,10,8,7,6,5,3,2,1,0],
    '冰心': [5,6,10,11,15,16,20,21,0,1,22,23,17,18,12,13,7,8,2,3,4,9,14,19,24],
    '奶秀': [24,19,14,23,22,21,20,18,17,16,15,13,12,11,10,9,8,7,6,5,4,3,2,1,0],
    '易筋': [0,1,5,6,10,11,15,16,20,21,2,3,7,8,12,13,17,18,22,23,4,9,14,19,24],
    '洗髓': [9,14,4,19,24,23,22,21,20,18,17,16,15,13,12,11,10,8,7,6,5,3,2,1,0],
    '气纯': [5,6,10,11,15,16,20,21,0,1,22,23,17,18,12,13,7,8,2,3,4,9,14,19,24],
    '剑纯': [7,8,12,13,17,18,22,23,2,3,0,1,5,6,10,11,15,16,20,21,4,9,14,19,24],
    '莫问': [15,16,20,21,10,11,5,6,0,1,22,23,17,18,12,13,7,8,2,3,4,9,14,19,24],
    '奶歌': [24,19,14,23,22,21,20,18,17,16,15,13,12,11,10,9,8,7,6,5,4,3,2,1,0],
    '天罗': [15,16,20,21,5,6,10,11,22,23,17,18,12,13,7,8,0,1,2,3,4,9,14,19,24],
    '惊羽': [23,22,18,17,13,12,7,8,20,21,15,16,10,11,5,6,2,3,0,1,4,9,14,19,24],
    '毒经': [10,11,15,16,20,21,5,6,0,1,22,23,17,18,12,13,7,8,2,3,4,9,14,19,24],
    '奶毒': [24,19,14,23,22,21,20,18,17,16,15,13,12,11,10,9,8,7,6,5,4,3,2,1,0],
    '铁骨': [19,24,23,22,18,17,13,12,8,7,21,20,16,15,10,11,5,6,14,9,4,3,2,1,0],
    '分山': [12,13,17,18,22,23,7,8,20,21,15,16,10,11,5,6,2,3,0,1,4,9,14,19,24],
    '丐帮': [2,3,7,8,12,13,17,18,22,23,0,1,5,6,10,11,15,16,20,21,4,9,14,19,24],
    '蓬莱': [7,8,12,13,17,18,22,23,20,21,15,16,10,11,5,6,0,1,2,3,4,9,14,19,24],
    '藏剑': [7,8,12,13,17,18,22,23,20,21,15,16,10,11,5,6,0,1,2,3,4,9,14,19,24],
    '霸刀': [7,8,12,13,17,18,22,23,20,21,15,16,10,11,5,6,0,1,2,3,4,9,14,19,24],
    '刀宗': [7,8,12,13,17,18,22,23,20,21,15,16,10,11,5,6,0,1,2,3,4,9,14,19,24],
    '傲血': [7,8,12,13,17,18,22,23,20,21,15,16,10,11,5,6,0,1,2,3,4,9,14,19,24],
    '凌雪': [7,8,12,13,17,18,22,23,20,21,15,16,10,11,5,6,0,1,2,3,4,9,14,19,24],
    '铁牢': [14,9,4,19,24,23,22,18,17,12,13,7,8,20,21,15,16,10,11,5,6,0,1,2,3],
    '花间': [10,11,15,16,20,21,5,6,22,23,17,18,12,13,7,8,0,1,2,3,4,9,14,19,24],
    '衍天': [10,11,15,16,20,21,5,6,22,23,17,18,12,13,7,8,0,1,2,3,4,9,14,19,24],
    '奶花': [24,19,14,23,22,21,20,18,17,16,15,13,12,11,10,9,8,7,6,5,4,3,2,1,0],
    '无方': [10,11,15,16,20,21,5,6,22,23,17,18,12,13,7,8,0,1,2,3,4,9,14,19,24],
    '灵素': [24,19,14,23,22,21,20,18,17,16,15,13,12,11,10,9,8,7,6,5,4,3,2,1,0],
}